{"class_name": "Functional", "config": {"name": "VitTrainner", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "ragged": false, "name": "pixel_values"}, "name": "pixel_values", "inbound_nodes": []}, {"class_name": "Custom>TFViTMainLayer", "config": {"name": "vit", "trainable": true, "dtype": "float32", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": true, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "architectures": ["ViTModel"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": null, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "google/vit-base-patch16-224-in21k", "transformers_version": "4.20.1", "model_type": "vit", "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "intermediate_size": 3072, "hidden_act": "gelu", "hidden_dropout_prob": 0.0, "attention_probs_dropout_prob": 0.0, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "image_size": 224, "patch_size": 16, "num_channels": 3, "qkv_bias": true, "encoder_stride": 16}, "add_pooling_layer": false}, "name": "vit", "inbound_nodes": [[["pixel_values", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["vit", 0, 12, {"slice_spec": [{"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "Dense", "config": {"name": "outputs", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "outputs", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}], "input_layers": [["pixel_values", 0, 0]], "output_layers": [["outputs", 0, 0]]}, "keras_version": "2.8.0", "backend": "tensorflow"}